#Область ПрограммныйИнтерфейс
// Формирование формы документа
//
Процедура ДополнитьФорму(Форма) Экспорт
ИмяФормы = Форма.ИмяФормы;

Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
	ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда	
	ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);	
ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
	ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);			
ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);	
ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);	
КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура  ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ПолеВыбора = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	ПолеВыбора.ПутьКДанным = "Объект.КонтактноеЛицо";
	ПолеВыбора.Вид = ВидПоляФормы.ПолеВвода;	 
	
КонецПроцедуры

Процедура  ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеВыбора = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , Форма.Элементы.СуммаДокумента);
	ПолеВыбора.ПутьКДанным = "Объект.КонтактноеЛицо";
	ПолеВыбора.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры


#КонецОбласти	